KurtWubbels/WENDLab-Boards/wendlab/hardware/esp32/1.2/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
#menu.MSCOnBoot=USB Firmware MSC On Boot
#menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
#menu.ZigbeeMode=Zigbee Mode
#menu.PinNumbers=Pin Numbering

##############################################################

wendlab-st7701s.name=WENDLab 56mm Single

wendlab-st7701s.bootloader.tool=esptool_py
wendlab-st7701s.bootloader.tool.default=esptool_py

wendlab-st7701s.upload.tool=esptool_py
wendlab-st7701s.upload.tool.default=esptool_py
wendlab-st7701s.upload.tool.network=esp_ota

wendlab-st7701s.upload.maximum_size=1310720
wendlab-st7701s.upload.maximum_data_size=327680
wendlab-st7701s.upload.flags=
wendlab-st7701s.upload.extra_flags=
wendlab-st7701s.upload.use_1200bps_touch=false
wendlab-st7701s.upload.wait_for_upload_port=false

wendlab-st7701s.serial.disableDTR=false
wendlab-st7701s.serial.disableRTS=false

wendlab-st7701s.build.tarch=xtensa
wendlab-st7701s.build.bootloader_addr=0x0
wendlab-st7701s.build.target=esp32s3
wendlab-st7701s.build.mcu=esp32s3
wendlab-st7701s.build.core=esp32
wendlab-st7701s.build.variant=wendlab-st7701s
wendlab-st7701s.build.board=WENDLAB_56mm

wendlab-st7701s.build.usb_mode=1
wendlab-st7701s.build.cdc_on_boot=1
wendlab-st7701s.build.msc_on_boot=0
wendlab-st7701s.build.dfu_on_boot=0
wendlab-st7701s.build.f_cpu=240000000L
wendlab-st7701s.build.flash_size=16MB
wendlab-st7701s.build.flash_freq=80m
wendlab-st7701s.build.flash_mode=dio
wendlab-st7701s.build.boot=qio
wendlab-st7701s.build.boot_freq=80m
wendlab-st7701s.build.partitions=default
wendlab-st7701s.build.defines=
wendlab-st7701s.build.loop_core=1
wendlab-st7701s.build.event_core=0
wendlab-st7701s.build.psram_type=opi
wendlab-st7701s.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
wendlab-st7701s.menu.JTAGAdapter.default=Disabled
wendlab-st7701s.menu.JTAGAdapter.default.build.copy_jtag_files=0
wendlab-st7701s.menu.JTAGAdapter.builtin=Integrated USB JTAG
wendlab-st7701s.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
wendlab-st7701s.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
wendlab-st7701s.menu.JTAGAdapter.external=FTDI Adapter
wendlab-st7701s.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
wendlab-st7701s.menu.JTAGAdapter.external.build.copy_jtag_files=1
wendlab-st7701s.menu.JTAGAdapter.bridge=ESP USB Bridge
wendlab-st7701s.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
wendlab-st7701s.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

wendlab-st7701s.menu.PSRAM.disabled=Disabled
wendlab-st7701s.menu.PSRAM.disabled.build.defines=
wendlab-st7701s.menu.PSRAM.disabled.build.psram_type=qspi
wendlab-st7701s.menu.PSRAM.opi=OPI PSRAM
wendlab-st7701s.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
wendlab-st7701s.menu.PSRAM.opi.build.psram_type=opi

wendlab-st7701s.menu.FlashMode.qio=QIO 80MHz
wendlab-st7701s.menu.FlashMode.qio.build.flash_mode=dio
wendlab-st7701s.menu.FlashMode.qio.build.boot=qio
wendlab-st7701s.menu.FlashMode.qio.build.boot_freq=80m
wendlab-st7701s.menu.FlashMode.qio.build.flash_freq=80m
wendlab-st7701s.menu.FlashMode.qio120=QIO 120MHz
wendlab-st7701s.menu.FlashMode.qio120.build.flash_mode=dio
wendlab-st7701s.menu.FlashMode.qio120.build.boot=qio
wendlab-st7701s.menu.FlashMode.qio120.build.boot_freq=120m
wendlab-st7701s.menu.FlashMode.qio120.build.flash_freq=80m
wendlab-st7701s.menu.FlashMode.dio=DIO 80MHz
wendlab-st7701s.menu.FlashMode.dio.build.flash_mode=dio
wendlab-st7701s.menu.FlashMode.dio.build.boot=dio
wendlab-st7701s.menu.FlashMode.dio.build.boot_freq=80m
wendlab-st7701s.menu.FlashMode.dio.build.flash_freq=80m
wendlab-st7701s.menu.FlashMode.opi=OPI 80MHz
wendlab-st7701s.menu.FlashMode.opi.build.flash_mode=dout
wendlab-st7701s.menu.FlashMode.opi.build.boot=opi
wendlab-st7701s.menu.FlashMode.opi.build.boot_freq=80m
wendlab-st7701s.menu.FlashMode.opi.build.flash_freq=80m

wendlab-st7701s.menu.FlashSize.8M=8MB (64Mb)
wendlab-st7701s.menu.FlashSize.8M.build.flash_size=8MB
wendlab-st7701s.menu.FlashSize.16M=16MB (128Mb)
wendlab-st7701s.menu.FlashSize.16M.build.flash_size=16MB

wendlab-st7701s.menu.LoopCore.1=Core 1
wendlab-st7701s.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
wendlab-st7701s.menu.LoopCore.0=Core 0
wendlab-st7701s.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

wendlab-st7701s.menu.EventsCore.1=Core 1
wendlab-st7701s.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
wendlab-st7701s.menu.EventsCore.0=Core 0
wendlab-st7701s.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

wendlab-st7701s.menu.USBMode.hwcdc=Hardware CDC and JTAG
wendlab-st7701s.menu.USBMode.hwcdc.build.usb_mode=1

wendlab-st7701s.menu.CDCOnBoot.default=Disabled
wendlab-st7701s.menu.CDCOnBoot.default.build.cdc_on_boot=0
wendlab-st7701s.menu.CDCOnBoot.cdc=Enabled
wendlab-st7701s.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

# wendlab-st7701s.menu.MSCOnBoot.default=Disabled
# wendlab-st7701s.menu.MSCOnBoot.default.build.msc_on_boot=0
# wendlab-st7701s.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
# wendlab-st7701s.menu.MSCOnBoot.msc.build.msc_on_boot=1

# wendlab-st7701s.menu.DFUOnBoot.default=Disabled
# wendlab-st7701s.menu.DFUOnBoot.default.build.dfu_on_boot=0
# wendlab-st7701s.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
# wendlab-st7701s.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

# wendlab-st7701s.menu.UploadMode.default=UART0 / Hardware CDC
# wendlab-st7701s.menu.UploadMode.default.upload.use_1200bps_touch=false
# wendlab-st7701s.menu.UploadMode.default.upload.wait_for_upload_port=false
# wendlab-st7701s.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
# wendlab-st7701s.menu.UploadMode.cdc.upload.use_1200bps_touch=true
# wendlab-st7701s.menu.UploadMode.cdc.upload.wait_for_upload_port=true

wendlab-st7701s.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
wendlab-st7701s.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
wendlab-st7701s.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

