KurtWubbels/WENDLab-Boards/wendlab/hardware/esp32/1.2/boards.txt
wendlab-st7789v3.menu.USBMode.hwcdc=Hardware CDC and JTAG
wendlab-st7789v3.menu.USBMode.hwcdc.build.usb_mode=1

wendlab-st7789v3.menu.CDCOnBoot.default=Disabled
wendlab-st7789v3.menu.CDCOnBoot.default.build.cdc_on_boot=0
wendlab-st7789v3.menu.CDCOnBoot.cdc=Enabled
wendlab-st7789v3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

wendlab-st7789v3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
wendlab-st7789v3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
wendlab-st7789v3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

wendlab-st7789v3.menu.CPUFreq.240=240MHz (WiFi)
wendlab-st7789v3.menu.CPUFreq.240.build.f_cpu=240000000L

wendlab-st7789v3.menu.UploadSpeed.921600=921600
wendlab-st7789v3.menu.UploadSpeed.921600.upload.speed=921600
wendlab-st7789v3.menu.UploadSpeed.115200=115200
wendlab-st7789v3.menu.UploadSpeed.115200.upload.speed=115200
wendlab-st7789v3.menu.UploadSpeed.256000.windows=256000
wendlab-st7789v3.menu.UploadSpeed.256000.upload.speed=256000
wendlab-st7789v3.menu.UploadSpeed.230400.windows.upload.speed=256000
wendlab-st7789v3.menu.UploadSpeed.230400=230400
wendlab-st7789v3.menu.UploadSpeed.230400.upload.speed=230400
wendlab-st7789v3.menu.UploadSpeed.460800.linux=460800
wendlab-st7789v3.menu.UploadSpeed.460800.macosx=460800
wendlab-st7789v3.menu.UploadSpeed.460800.upload.speed=460800
wendlab-st7789v3.menu.UploadSpeed.512000.windows=512000
wendlab-st7789v3.menu.UploadSpeed.512000.upload.speed=512000

wendlab-st7789v3.menu.DebugLevel.none=None
wendlab-st7789v3.menu.DebugLevel.none.build.code_debug=0
wendlab-st7789v3.menu.DebugLevel.error=Error
wendlab-st7789v3.menu.DebugLevel.error.build.code_debug=1
wendlab-st7789v3.menu.DebugLevel.warn=Warn
wendlab-st7789v3.menu.DebugLevel.warn.build.code_debug=2
wendlab-st7789v3.menu.DebugLevel.info=Info
wendlab-st7789v3.menu.DebugLevel.info.build.code_debug=3
wendlab-st7789v3.menu.DebugLevel.debug=Debug
wendlab-st7789v3.menu.DebugLevel.debug.build.code_debug=4
wendlab-st7789v3.menu.DebugLevel.verbose=Verbose
wendlab-st7789v3.menu.DebugLevel.verbose.build.code_debug=5

wendlab-st7789v3.menu.EraseFlash.none=Disabled
wendlab-st7789v3.menu.EraseFlash.none.upload.erase_cmd=
wendlab-st7789v3.menu.EraseFlash.all=Enabled
wendlab-st7789v3.menu.EraseFlash.all.upload.erase_cmd=-e


##############################################################

wendlab-st77903.name=WENDLab 45mm Single

wendlab-st77903.bootloader.tool=esptool_py
wendlab-st77903.bootloader.tool.default=esptool_py

wendlab-st77903.upload.tool=esptool_py
wendlab-st77903.upload.tool.default=esptool_py
wendlab-st77903.upload.tool.network=esp_ota

wendlab-st77903.upload.maximum_size=1310720
wendlab-st77903.upload.maximum_data_size=327680
wendlab-st77903.upload.flags=
wendlab-st77903.upload.extra_flags=
wendlab-st77903.upload.use_1200bps_touch=false
wendlab-st77903.upload.wait_for_upload_port=false

wendlab-st77903.serial.disableDTR=false
wendlab-st77903.serial.disableRTS=false

wendlab-st77903.build.tarch=xtensa
wendlab-st77903.build.bootloader_addr=0x0
wendlab-st77903.build.target=esp32s3
wendlab-st77903.build.mcu=esp32s3
wendlab-st77903.build.core=esp32
wendlab-st77903.build.variant=wendlab-st77903
wendlab-st77903.build.board=WENDLAB_45mm

wendlab-st77903.build.usb_mode=1
wendlab-st77903.build.cdc_on_boot=1
wendlab-st77903.build.msc_on_boot=0
wendlab-st77903.build.dfu_on_boot=0
wendlab-st77903.build.f_cpu=240000000L
wendlab-st77903.build.flash_size=16MB
wendlab-st77903.build.flash_freq=80m
wendlab-st77903.build.flash_mode=dio
wendlab-st77903.build.boot=qio
wendlab-st77903.build.boot_freq=80m
wendlab-st77903.build.partitions=default
wendlab-st77903.build.defines=
wendlab-st77903.build.loop_core=1
wendlab-st77903.build.event_core=0
wendlab-st77903.build.psram_type=qspi
wendlab-st77903.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
wendlab-st77903.menu.JTAGAdapter.default=Disabled
wendlab-st77903.menu.JTAGAdapter.default.build.copy_jtag_files=0
wendlab-st77903.menu.JTAGAdapter.builtin=Integrated USB JTAG
wendlab-st77903.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
wendlab-st77903.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
wendlab-st77903.menu.JTAGAdapter.external=FTDI Adapter
wendlab-st77903.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
wendlab-st77903.menu.JTAGAdapter.external.build.copy_jtag_files=1
wendlab-st77903.menu.JTAGAdapter.bridge=ESP USB Bridge
wendlab-st77903.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
wendlab-st77903.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

wendlab-st77903.menu.PSRAM.disabled=Disabled
wendlab-st77903.menu.PSRAM.disabled.build.defines=
wendlab-st77903.menu.PSRAM.disabled.build.psram_type=qspi
esp32s3.menu.PSRAM.enabled=QSPI PSRAM
esp32s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
esp32s3.menu.PSRAM.enabled.build.psram_type=qspi
wendlab-st77903.menu.PSRAM.opi=OPI PSRAM
wendlab-st77903.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
wendlab-st77903.menu.PSRAM.opi.build.psram_type=opi

wendlab-st77903.menu.FlashMode.qio=QIO 80MHz
wendlab-st77903.menu.FlashMode.qio.build.flash_mode=dio
wendlab-st77903.menu.FlashMode.qio.build.boot=qio
wendlab-st77903.menu.FlashMode.qio.build.boot_freq=80m
wendlab-st77903.menu.FlashMode.qio.build.flash_freq=80m
wendlab-st77903.menu.FlashMode.qio120=QIO 120MHz
wendlab-st77903.menu.FlashMode.qio120.build.flash_mode=dio
wendlab-st77903.menu.FlashMode.qio120.build.boot=qio
wendlab-st77903.menu.FlashMode.qio120.build.boot_freq=120m
wendlab-st77903.menu.FlashMode.qio120.build.flash_freq=80m
wendlab-st77903.menu.FlashMode.dio=DIO 80MHz
wendlab-st77903.menu.FlashMode.dio.build.flash_mode=dio
wendlab-st77903.menu.FlashMode.dio.build.boot=dio
wendlab-st77903.menu.FlashMode.dio.build.boot_freq=80m
wendlab-st77903.menu.FlashMode.dio.build.flash_freq=80m
wendlab-st77903.menu.FlashMode.opi=OPI 80MHz
wendlab-st77903.menu.FlashMode.opi.build.flash_mode=dout
wendlab-st77903.menu.FlashMode.opi.build.boot=opi
wendlab-st77903.menu.FlashMode.opi.build.boot_freq=80m
wendlab-st77903.menu.FlashMode.opi.build.flash_freq=80m

wendlab-st77903.menu.FlashSize.8M=8MB (64Mb)
wendlab-st77903.menu.FlashSize.8M.build.flash_size=8MB
wendlab-st77903.menu.FlashSize.16M=16MB (128Mb)
wendlab-st77903.menu.FlashSize.16M.build.flash_size=16MB

wendlab-st77903.menu.LoopCore.1=Core 1
wendlab-st77903.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
wendlab-st77903.menu.LoopCore.0=Core 0
wendlab-st77903.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

wendlab-st77903.menu.EventsCore.1=Core 1
wendlab-st77903.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
wendlab-st77903.menu.EventsCore.0=Core 0
wendlab-st77903.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

