KurtWubbels/WENDLab-Boards/wendlab/hardware/esp32/1.2/boards.txt
wendlab-st77903.menu.USBMode.hwcdc=Hardware CDC and JTAG
wendlab-st77903.menu.USBMode.hwcdc.build.usb_mode=1

wendlab-st77903.menu.CDCOnBoot.default=Disabled
wendlab-st77903.menu.CDCOnBoot.default.build.cdc_on_boot=0
wendlab-st77903.menu.CDCOnBoot.cdc=Enabled
wendlab-st77903.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

wendlab-st77903.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
wendlab-st77903.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
wendlab-st77903.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

wendlab-st77903.menu.CPUFreq.240=240MHz (WiFi)
wendlab-st77903.menu.CPUFreq.240.build.f_cpu=240000000L

wendlab-st77903.menu.UploadSpeed.921600=921600
wendlab-st77903.menu.UploadSpeed.921600.upload.speed=921600
wendlab-st77903.menu.UploadSpeed.115200=115200
wendlab-st77903.menu.UploadSpeed.115200.upload.speed=115200
wendlab-st77903.menu.UploadSpeed.256000.windows=256000
wendlab-st77903.menu.UploadSpeed.256000.upload.speed=256000
wendlab-st77903.menu.UploadSpeed.230400.windows.upload.speed=256000
wendlab-st77903.menu.UploadSpeed.230400=230400
wendlab-st77903.menu.UploadSpeed.230400.upload.speed=230400
wendlab-st77903.menu.UploadSpeed.460800.linux=460800
wendlab-st77903.menu.UploadSpeed.460800.macosx=460800
wendlab-st77903.menu.UploadSpeed.460800.upload.speed=460800
wendlab-st77903.menu.UploadSpeed.512000.windows=512000
wendlab-st77903.menu.UploadSpeed.512000.upload.speed=512000

wendlab-st77903.menu.DebugLevel.none=None
wendlab-st77903.menu.DebugLevel.none.build.code_debug=0
wendlab-st77903.menu.DebugLevel.error=Error
wendlab-st77903.menu.DebugLevel.error.build.code_debug=1
wendlab-st77903.menu.DebugLevel.warn=Warn
wendlab-st77903.menu.DebugLevel.warn.build.code_debug=2
wendlab-st77903.menu.DebugLevel.info=Info
wendlab-st77903.menu.DebugLevel.info.build.code_debug=3
wendlab-st77903.menu.DebugLevel.debug=Debug
wendlab-st77903.menu.DebugLevel.debug.build.code_debug=4
wendlab-st77903.menu.DebugLevel.verbose=Verbose
wendlab-st77903.menu.DebugLevel.verbose.build.code_debug=5

wendlab-st77903.menu.EraseFlash.none=Disabled
wendlab-st77903.menu.EraseFlash.none.upload.erase_cmd=
wendlab-st77903.menu.EraseFlash.all=Enabled
wendlab-st77903.menu.EraseFlash.all.upload.erase_cmd=-e

